// 算數運算子（+ - * / ％）

let a = 10;

a = a + 2; // 12
a = a - 2; // 8
a = a * 2; // 20
a = a ** 2; // 10^2 = 10 * 10 = 100（10的2次方）
a = a / 2; // 5
a = a % 2; // 10 % 2 = 5...0（取餘數）

// 縮寫

a += 2;
a -= 2;
a *= 2;
a **= 2;
a /= 2;
a %= 2;
a++; // ++ = + 1， 所以a++ = a + 1 = 11
a--; // -- = - 1， 所以a-- = a - 1 = 9

console.log(a);

/*
運算子優先順序
1.括號
2.指數（指次方，**的部分）
3.乘法、除法、取餘數（* 、 / 、％）
4.加法、減法（+ 、 -）
*/

let result1 = 2 + 3 * 4 + 5 ** 2;
console.log(result1); // 25 + 12 + 2 = 39

let result2 = (11 % 5) + 9 / 3 + (4 + 5);
console.log(result2); // 9 + 3 + 1 = 13

let result3 = 4 / 2 ** (2 + 3);
console.log(result3); // 2^5 = 32, 4 / 32 = 1 / 8 = 0.125
